app/views/dashboards/show.html.erb

      <tbody>
        <% @dashboard.news_feeds.each do |news_feed| %>
---
SELECT "news_feeds".* FROM "news_feeds" WHERE "news_feeds"."dashboard_id" = $1  [["dashboard_id", 1]]

  <div class="row">
    <% @dashboard.uploads.each do |upload| %>
---
SELECT "uploads".* FROM "uploads" WHERE "uploads"."dashboard_id" = $1  [["dashboard_id", 2]]